Revit 2024 API
ExternalResourceTypes.BuiltInExternalResourceTypes.RevitLink Property
 An external resource type representing Revit Links data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalResourceType RevitLink { get; }
Visual Basic
Public Shared ReadOnly Property RevitLink As ExternalResourceType
	Get
Visual C++
public:
static property ExternalResourceType^ RevitLink {
	ExternalResourceType^ get ();
}
See Also
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace